<a href="https://colab.research.google.com/github/MinakoNG63/DSFB/blob/main/06_More_Advanced_Pandas_63070240.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# More Advanced Pandas

Term 1 2022 - Instructor: Teerapong Leelanupab

Teaching Assistant:
1. Piyawat Chuangkrud (Sam)
2. Suvapat Manu (Mint)

***

In [ ]:
!mkdir data

# download goal_scorers.csv
!gdown --id 1rDxrXatFMu8WLLFTFJuRnW5KIkeFOFyG -O data/goal_scorers.csv

# download titanic.csv
!wget https://www.it.kmitl.ac.th/~teerapong/resources/ds4biz/Week2/titanic.csv -P data/

Downloading...
From: https://drive.google.com/uc?id=1rDxrXatFMu8WLLFTFJuRnW5KIkeFOFyG
To: /content/data/goal_scorers.csv
100% 664/664 [00:00<00:00, 1.43MB/s]
--2021-08-09 09:04:41--  https://www.it.kmitl.ac.th/~teerapong/resources/ds4biz/Week2/titanic.csv
Resolving www.it.kmitl.ac.th (www.it.kmitl.ac.th)... 161.246.38.38
Connecting to www.it.kmitl.ac.th (www.it.kmitl.ac.th)|161.246.38.38|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 28629 (28K) [text/csv]
Saving to: ‘data/titanic.csv’

titanic.csv         100%[===================>]  27.96K  --.-KB/s    in 0s

2021-08-09 09:04:42 (258 MB/s) - ‘data/titanic.csv’ saved [28629/28629]

In [ ]:
# Load the Pandas package for use in this notebook
import pandas as pd

## 1. Data Normalisation

We may often want to scale numeric values in a Data Frame to conform to minimum and maximum values.

In [ ]:
df = pd.DataFrame({"home":[0,3,2,4,2,1],"away":[0,1,0,2,0,0]})
df

   home  away
0     0     0
1     3     1
2     2     0
3     4     2
4     2     0
5     1     0

We can apply simple arithmetic operations to scale numeric Data Frames:

In [ ]:
df / 10

   home  away
0   0.0   0.0
1   0.3   0.1
2   0.2   0.0
3   0.4   0.2
4   0.2   0.0
5   0.1   0.0

In [ ]:
print( df.describe() )

           home     away
count  6.000000  6.00000
mean   2.000000  0.50000
std    1.414214  0.83666
min    0.000000  0.00000
25%    1.250000  0.00000
50%    2.000000  0.00000
75%    2.750000  0.75000
max    4.000000  2.00000

This allows us to easily normalise our data in different ways. For instance, we can subtract the mean column values from each row in the data frame:

In [ ]:
df - df.mean()

   home  away
0  -2.0  -0.5
1   1.0   0.5
2   0.0  -0.5
3   2.0   1.5
4   0.0  -0.5
5  -1.0  -0.5

We could also divide each row by maximum value for each column

In [ ]:
ndf = df / df.max()
ndf

   home  away
0  0.00   0.0
1  0.75   0.5
2  0.50   0.0
3  1.00   1.0
4  0.50   0.0
5  0.25   0.0

If we have made any modifications to a Data Frame, we can export the data as a new CSV file using the *to_csv()* function.

In [ ]:
ndf.to_csv("data/modified.csv")

***
## 2. Aggregating Data

Let's try a simple example of aggregating data stored in a Data Frame. This aggregation is based on a categorical value in each row.

In [ ]:
df = pd.DataFrame({"Name":["E. Kenny","M. Martin","L. Varadkar","N. Collins","J. Burton"],
                   "Party":["Fine Gael","Fianna Fail","Fine Gael", "Fianna Fail", "Labour"],
                   "Tweets": [ 399, 938, 1830, 1946, 907 ]})
df

          Name        Party  Tweets
0     E. Kenny    Fine Gael     399
1    M. Martin  Fianna Fail     938
2  L. Varadkar    Fine Gael    1830
3   N. Collins  Fianna Fail    1946
4    J. Burton       Labour     907

We will group the rows (i.e. the politicians) using the "Party" columns

In [ ]:
groups = df.groupby("Party")


We can now apply the *sum()* function to get the total sum of tweets for each party:

In [ ]:
groups.sum()

             Tweets
Party
Fianna Fail    2884
Fine Gael      2229
Labour          907

We can also get the mean number of tweets for each party:

In [ ]:
groups.mean()

             Tweets
Party
Fianna Fail  1442.0
Fine Gael    1114.5
Labour        907.0

As a second example, we load dataset of top Premier League goal scorers from the CSV file provided. We will use the player name as the index columns

In [ ]:
df = pd.read_csv("data/goal_scorers.csv",index_col="Player")
df

                         Team  Total Goals  Penalties  Home Goals  Away Goals
Player
J Vardy        Leicester City           19          4          11           8
H Kane              Tottenham           16          4           7           9
R Lukaku              Everton           16          1           8           8
O Ighalo              Watford           15          0           8           7
S Aguero      Manchester City           14          1          10           4
R Mahrez       Leicester City           14          4           4          10
O Giroud              Arsenal           12          0           4           8
D Costa               Chelsea           10          0           7           3
J Defoe            Sunderland           10          0           3           7
G Wijnaldum     Newcastle Utd            9          0           9           0
T Deeney              Watford            8          5           2           6
R Barkley             Everton            8          2           5           3
A Ayew           Swansea City            8          0           5           3
G Sigurdsson     Swansea City            7          3           2           5
W Rooney       Manchester Utd            7          1           3           4
A Martial      Manchester Utd            7          0           4           3
D Alli              Tottenham            7          0           1           6
D Payet          West Ham Utd            7          0           3           4
M Arnautovic       Stoke City            7          2           4           3
Y Toure       Manchester City            7          0           3           4

Let's group the players based on the team that they play for (i.e the column with index "Team"):

In [ ]:
groups = df.groupby("Team")

We can now sum over the values for each team to get the total for each column:

In [ ]:
groups.sum()

                 Total Goals  Penalties  Home Goals  Away Goals
Team
Arsenal                   12          0           4           8
Chelsea                   10          0           7           3
Everton                   24          3          13          11
Leicester City            33          8          15          18
Manchester City           21          1          13           8
Manchester Utd            14          1           7           7
Newcastle Utd              9          0           9           0
Stoke City                 7          2           4           3
Sunderland                10          0           3           7
Swansea City              15          3           7           8
Tottenham                 23          4           8          15
Watford                   23          5          10          13
West Ham Utd               7          0           3           4

We could also have calculated the mean goals per team:

In [ ]:
groups.mean()

                 Total Goals  Penalties  Home Goals  Away Goals
Team
Arsenal                 12.0        0.0         4.0         8.0
Chelsea                 10.0        0.0         7.0         3.0
Everton                 12.0        1.5         6.5         5.5
Leicester City          16.5        4.0         7.5         9.0
Manchester City         10.5        0.5         6.5         4.0
Manchester Utd           7.0        0.5         3.5         3.5
Newcastle Utd            9.0        0.0         9.0         0.0
Stoke City               7.0        2.0         4.0         3.0
Sunderland              10.0        0.0         3.0         7.0
Swansea City             7.5        1.5         3.5         4.0
Tottenham               11.5        2.0         4.0         7.5
Watford                 11.5        2.5         5.0         6.5
West Ham Utd             7.0        0.0         3.0         4.0

***
## 3. Handling Missing Values

Many real datasets have missing values, either because it exists and was not collected or it never existed. When we load the dataset titanic.csv dataset, we see that some columns have many missing values - i.e. they contain the null/empty value *NaN*.

In [ ]:
df = pd.read_csv("data/titanic.csv")
df

     PassengerId  Pclass  ... Cabin Embarked
0            892       3  ...   NaN        Q
1            893       3  ...   NaN        S
2            894       2  ...   NaN        Q
3            895       3  ...   NaN        S
4            896       3  ...   NaN        S
..           ...     ...  ...   ...      ...
413         1305       3  ...   NaN        S
414         1306       1  ...  C105        C
415         1307       3  ...   NaN        S
416         1308       3  ...   NaN        S
417         1309       3  ...   NaN        C

[418 rows x 11 columns]

In [ ]:
df.shape

(418, 11)

In [ ]:
df.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

One option is to simply drop a feature with many missing values. So we could drop the "Age" column using the *drop()* function:

In [ ]:
df.drop(["Age"], axis=1)

     PassengerId  Pclass  ... Cabin Embarked
0            892       3  ...   NaN        Q
1            893       3  ...   NaN        S
2            894       2  ...   NaN        Q
3            895       3  ...   NaN        S
4            896       3  ...   NaN        S
..           ...     ...  ...   ...      ...
413         1305       3  ...   NaN        S
414         1306       1  ...  C105        C
415         1307       3  ...   NaN        S
416         1308       3  ...   NaN        S
417         1309       3  ...   NaN        C

[418 rows x 10 columns]

However, if we expect age to play an important role, then we want to keep the column and estimate the missing values in some way.
A simple approach is to fill in missing values using the mean value.

In [ ]:
mean_age = df["Age"].mean()
mean_age

30.272590361445783

In [ ]:
# Replace all NaN values in the Age column with the mean value
df["Age"] = df["Age"].fillna(mean_age)
df

     PassengerId  Pclass  ... Cabin Embarked
0            892       3  ...   NaN        Q
1            893       3  ...   NaN        S
2            894       2  ...   NaN        Q
3            895       3  ...   NaN        S
4            896       3  ...   NaN        S
..           ...     ...  ...   ...      ...
413         1305       3  ...   NaN        S
414         1306       1  ...  C105        C
415         1307       3  ...   NaN        S
416         1308       3  ...   NaN        S
417         1309       3  ...   NaN        C

[418 rows x 11 columns]

Confirm that the "Age" column no longer has any missing values:

In [ ]:
df.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

***
Delete data/modified.csv to repeat practicing this lab with a clean notebook.

In [ ]:
!rm data/modified.csv